ap-software+data.tex
\chapter{SOFTWARE AND DATA CONTRIBUTIONS}
\label{sec:orgc7f868a}
\section*{Data Publication}
\label{sec:org3731a35}
The prepared sample data I used was published to the Materials Data Facility.
It is available to download with a simple API call following installation and activation\footnote{\url{https://ai-materials-and-chemistry.gitbook.io/foundry/}} of the relevant packages and applications.

\begin{ZZlisting}
  \caption{\label{lst:MDF} How to load the Mannodi Group halide perovskites data set from the Materials Data Facility repository}
  \begin{CenteredBox}
    \begin{lstlisting}[language=python]
# THIS IS PENDING
f = Foundry(
    no_local_server=True,
    no_browser=True,
    globus=True,
    index="mdf"
)
f.load("foundry_mrg_band_gaps_v1.0", globus=globus)
res = f.load_data()
X_mp, y_mp = res['train'][0], res['train'][1]
    \end{lstlisting}
  \end{CenteredBox}
\end{ZZlisting}

\section*{Software Tools}
\label{sec:org660d957}
I have made available the following python libraries to ease aggregation, sharing, analysis and reporting of large computational datasets.

The \texttt{cmcl} library\footnote{\url{https://github.com/PanayotisManganaris/cmcl}} is under early development under tag v0.1.5.
At this stage, cmcl strives to provide an inquisitive interface to perovskite composition feature computers in the style of the pandas API.
Listing \ref{lst:cmcl} demonstrates its use in extracting composition vectors from the formula strings identifying each compound in a dataset.

A library of model evaluation tools to assist with exhaustive grid search is being maintained in the \texttt{yogi} repository.\footnote{\url{https://github.com/PanayotisManganaris/yogi}}
A grid-search assistant under the \texttt{yogi.model\_selection.butler} module was used to optimize the hyper-parameters of models reported here.
See documentation for the various grid-narrowing strategies available.

Matgenix\footnote{\url{https://github.com/Matgenix/pysisso}} company initially created a SciKit-learn compliant interface to the SISSO algorithm maintained by \textcite{ouyang-2018-sisso}.
This code was forked and modified\footnote{\url{https://github.com/PanayotisManganaris/pysisso}} to enable the creation of the SIS domain engineered regressions primarily by creating a custom \texttt{Function Transformer} that may be seeded with the subspace information obtained by first training a SISSO regression using the conventional interface.
This was done with the expectation that the resulting model would be superior for the purposes of this work, but it is generally applicable to any other applications demanding this sort of dimensionality reduction.

A tutorial delivered in the Spring 2022 Materials Research Society conference details the use of these packages for multi-fidelity model training for materials property prediction.
This is provided in the form of an iPython notebook hosted on the Purdue University nanoHUB.
\fullcite{manganaris-2022-mrs-comput}
This provides only a detailed example of the use of \texttt{cmcl} and \texttt{yogi} in feature extraction and training multi-fidelity random forest models.
Examples for the use of the modified pysisso code may be found in the github repository associated with our publication \citetitle{manganaris-2023-multi-fidel}.
